## EDA

In [83]:
import pandas as pd
import numpy as np
from IPython.display import display

## Cargamos CSV y visualizamos las primeras 5 filas

In [84]:
df = pd.read_csv("data.csv", index_col=0) 

display(df.head())

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,...,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,...,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,...,19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [85]:
df.shape
print(f'Tenemos {df.shape[0]} filas y {df.shape[1]} columnas')

Tenemos 1678 filas y 41 columnas

In [86]:
df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   object
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeecount             1678 non-null   int64
 9   employeenumber            1678 non-null   int64
 10  environmentsatisfaction   1678 non-null   int64
 11  gender                    1678 non-null   int64
 12  hourlyrate                411 non-null    float64
 13  jobinvolvement            1678 non-null   int64
 14  joblevel                  1678 non-null   int64
 15  jobrole                   1678 non-null   object
 16  jobsatisfaction           1678 non-null   int64
 17  maritalstatus             1003 non-null   object
 18  monthlyincome             1189 non-null   object
 19  monthlyrate               1678 non-null   object
 20  numcompaniesworked        1678 non-null   int64
 21  over18                    740 non-null    object
 22  overtime                  982 non-null    object
 23  percentsalaryhike         1678 non-null   int64
 24  performancerating         1478 non-null   object
 25  relationshipsatisfaction  1678 non-null   int64
 26  standardhours             1327 non-null   object
 27  stockoptionlevel          1678 non-null   int64
 28  totalworkingyears         1129 non-null   object
 29  trainingtimeslastyear     1678 non-null   int64
 30  worklifebalance           1564 non-null   object
 31  yearsatcompany            1678 non-null   int64
 32  yearsincurrentrole        35 non-null     object
 33  yearssincelastpromotion   1678 non-null   int64
 34  yearswithcurrmanager      1678 non-null   int64
 35  sameasmonthlyincome       1189 non-null   object
 36  datebirth                 1678 non-null   int64
 37  salary                    1393 non-null   object
 38  roledepartament           312 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1678 non-null   object
dtypes: float64(3), int64(18), object(20)
memory usage: 550.6+ KB

## Identificar valores nulos

In [88]:
df.isnull().sum()

age                            0
attrition                      0
businesstravel               801
dailyrate                      0
department                  1366
distancefromhome               0
education                      0
educationfield               774
employeecount                  0
employeenumber                 0
environmentsatisfaction        0
gender                         0
hourlyrate                  1267
jobinvolvement                 0
joblevel                       0
jobrole                        0
jobsatisfaction                0
maritalstatus                675
monthlyincome                489
monthlyrate                    0
numcompaniesworked             0
over18                       938
overtime                     696
percentsalaryhike              0
performancerating            200
relationshipsatisfaction       0
standardhours                351
stockoptionlevel               0
totalworkingyears            549
trainingtimeslastyear          0
worklifebalance              114
yearsatcompany                 0
yearsincurrentrole          1643
yearssincelastpromotion        0
yearswithcurrmanager           0
sameasmonthlyincome          489
datebirth                      0
salary                       285
roledepartament             1366
numberchildren              1678
remotework                     0
dtype: int64

## Porcentaje de valores nulos en cada columna

In [89]:
(df.isnull().sum() / len(df)) * 100

age                           0.000000
attrition                     0.000000
businesstravel               47.735399
dailyrate                     0.000000
department                   81.406436
distancefromhome              0.000000
education                     0.000000
educationfield               46.126341
employeecount                 0.000000
employeenumber                0.000000
environmentsatisfaction       0.000000
gender                        0.000000
hourlyrate                   75.506555
jobinvolvement                0.000000
joblevel                      0.000000
jobrole                       0.000000
jobsatisfaction               0.000000
maritalstatus                40.226460
monthlyincome                29.141836
monthlyrate                   0.000000
numcompaniesworked            0.000000
over18                       55.899881
overtime                     41.477950
percentsalaryhike             0.000000
performancerating            11.918951
relationshipsatisfaction      0.000000
standardhours                20.917759
stockoptionlevel              0.000000
totalworkingyears            32.717521
trainingtimeslastyear         0.000000
worklifebalance               6.793802
yearsatcompany                0.000000
yearsincurrentrole           97.914184
yearssincelastpromotion       0.000000
yearswithcurrmanager          0.000000
sameasmonthlyincome          29.141836
datebirth                     0.000000
salary                       16.984505
roledepartament              81.406436
numberchildren              100.000000
remotework                    0.000000
dtype: float64

## Toma de decisión con respecto a los datos nulos obtenidos:

#### Eliminamos las columnas en las que elporcentaje de valores nulos sea superior al 80%.

Columnas para  eliminar:
- "department" (81.40%)
- "roledepartament" (81.40%)
- "numberchildren" (100%)
- "yearsincurrentrole" (97.91%)

In [90]:
df.drop(columns=["department", "roledepartament", "numberchildren", "yearsincurrentrole"], inplace=True)

### Visualización del dataframe tras la eliminación de columnas

In [91]:
df.head()

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,...,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,remotework
0,51,No,NaN,2015.722222,6,3,NaN,1,1,1,...,NaN,5,"3,0",20,15,15,"16280,83$",1972,"195370,00$",Yes
1,52,No,NaN,2063.388889,1,4,Life Sciences,1,2,3,...,"34,0",5,"3,0",33,11,9,NaN,1971,"199990,00$",1
2,42,No,travel_rarely,1984.253968,4,2,Technical Degree,1,3,3,...,"22,0",3,NaN,22,11,15,NaN,1981,"192320,00$",1
3,47,No,travel_rarely,1771.404762,2,4,Medical,1,4,1,...,NaN,2,NaN,20,5,6,"14307,50$",1976,"171690,00$",False
4,46,No,NaN,1582.771346,3,3,Technical Degree,1,5,1,...,NaN,5,"3,0",19,2,8,"12783,92$",1977,NaN,0

## Dividimos la limpieza y transformación de columnas según el tipo de valor.
### Comenzamos filtrando las columnas de tipo categóricas

In [92]:
columns_object = df.select_dtypes(include = object)

In [93]:
columns_object.shape

(1678, 17)

In [94]:
columns_object.columns

Index(['age', 'attrition', 'businesstravel', 'educationfield', 'jobrole',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18', 'overtime',
       'performancerating', 'standardhours', 'totalworkingyears',
       'worklifebalance', 'sameasmonthlyincome', 'salary', 'remotework'],
      dtype='object')

## COLUMNAS LIMPIEZA SARA

In [95]:
columnas = ['overtime', 'performancerating', 'standardhours', 'totalworkingyears',
    'worklifebalance', 'sameasmonthlyincome',
    'salary','remotework']

In [96]:
df[columnas].info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   overtime             982 non-null    object
 1   performancerating    1478 non-null   object
 2   standardhours        1327 non-null   object
 3   totalworkingyears    1129 non-null   object
 4   worklifebalance      1564 non-null   object
 5   sameasmonthlyincome  1189 non-null   object
 6   salary               1393 non-null   object
 7   remotework           1678 non-null   object
dtypes: object(8)
memory usage: 118.0+ KB

In [97]:
for col in columnas:
    print(f"Valores únicos en '{col}':")
    print(df[col].unique(), "\n")

Valores únicos en 'overtime':
['No' nan 'Yes']

Valores únicos en 'performancerating':
['3,0' '4,0' nan]

Valores únicos en 'standardhours':
['Full Time' nan 'Part Time']

Valores únicos en 'totalworkingyears':
[nan '34,0' '22,0' '28,0' '20,0' '21,0' '33,0' '40,0' '18,0' '25,0' '15,0'
 '17,0' '26,0' '16,0' '24,0' '14,0' '23,0' '27,0' '19,0' '11,0' '38,0'
 '37,0' '13,0' '12,0' '29,0' '10,0' '36,0' '35,0' '9,0' '31,0' '32,0'
 '8,0' '7,0' '30,0' '6,0' '5,0' '4,0' '3,0' '2,0' '1,0' '0,0']

Valores únicos en 'worklifebalance':
['3,0' nan '2,0' '4,0' '1,0']

Valores únicos en 'sameasmonthlyincome':
['16280,83$' nan '14307,50$' '12783,92$' '14311,67$' '8339,32$'
 '13829,17$' '15943,72$' '16644,17$' '15034,17$' '16038,33$' '4492,84$'
 '8956,67$' '5167,50$' '3334,17$' '8705,83$' '2675,00$' '8555,00$'
 '8729,17$' '3934,17$' '3845,83$' '14132,50$' '8588,33$' '4505,00$'
 '4918,33$' '4928,33$' '5538,33$' '11100,00$' '5572,50$' '11560,00$'
 '15870,83$' '13345,83$' '8010,83$' '3588,33$' '14205,00$' '4222,50$'
 '3076,67$' '2342,59$' '4789,17$' '8685,00$' '5289,17$' '1956,67$'
 '10408,33$' '6683,33$' '7452,50$' '16060,00$' '4647,50$' '2242,50$'
 '6169,17$' '7352,50$' '2982,50$' '14815,83$' '15177,50$' '15991,67$'
 '15989,17$' '8340,00$' '6656,67$' '5902,50$' '3935,83$' '2839,17$'
 '2440,83$' '10025,83$' '12855,83$' '5135,00$' '4271,67$' '8015,83$'
 '4175,00$' '15860,83$' '8666,67$' '2327,50$' '4728,33$' '7010,00$'
 '2790,00$' '4424,17$' '6378,33$' '10673,33$' '5488,33$' '2099,17$'
 '10933,33$' '2609,17$' '5561,67$' '14884,17$' '6205,00$' '11464,17$'
 '13831,67$' '2557,50$' '7700,83$' '5393,33$' '6934,17$' '7148,33$'
 '3497,50$' '8240,00$' '4730,83$' '7938,33$' '5687,50$' '3686,67$'
 '4534,17$' '5061,67$' '5143,33$' '4670,83$' '3599,17$' '2970,00$'
 '5217,50$' '5670,00$' '16196,67$' '4856,67$' '3901,67$' '1765,83$'
 '4978,33$' '11010,00$' '3375,83$' '4004,17$' '2284,17$' '7861,67$'
 '4496,67$' '9299,17$' '4133,33$' '7327,50$' '1846,67$' '9760,83$'
 '4420,00$' '9252,50$' '5526,67$' '6322,50$' '3612,50$' '4983,33$'
 '3536,67$' '4356,67$' '2250,00$' '1971,67$' '1940,83$' '8604,17$'
 '9037,50$' '5320,83$' '3050,00$' '7283,33$' '11249,17$' '2909,17$'
 '4350,00$' '8543,33$' '16450,00$' '5174,17$' '3778,33$' '7083,33$'
 '3865,83$' '4469,17$' '3400,83$' '8994,17$' '9042,50$' '3654,17$'
 '3388,33$' '4338,33$' '2212,50$' '2141,67$' '3751,67$' '4140,00$'
 '4289,17$' '2265,00$' '2949,17$' '4556,67$' '4844,17$' '8055,83$'
 '4729,17$' '6095,00$' '11308,33$' '8325,83$' '8540,00$' '9115,00$'
 '2160,83$' '9898,33$' '6745,83$' '14046,67$' '3780,83$' '3345,00$'
 '10618,33$' '8735,00$' '3540,83$' '5457,50$' '12009,17$' '6864,17$'
 '2675,83$' '13920,00$' '3806,67$' '4994,17$' '5415,83$' '5330,83$'
 '3018,33$' '5228,33$' '4573,33$' '2095,00$' '2663,33$' '2850,00$'
 '3405,83$' '3500,00$' '4171,67$' '5418,33$' '5290,83$' '3796,67$'
 '3525,00$' '8967,50$' '4336,67$' '14499,17$' '4295,83$' '15657,50$'
 '4069,17$' '2496,67$' '7731,67$' '3468,33$' '7377,50$' '6463,33$'
 '3324,17$' '3085,00$' '2254,17$' '3706,67$' '7448,33$' '8280,00$'
 '15616,67$' '4560,83$' '11252,50$' '11290,83$' '2311,67$' '7865,83$'
 '4387,50$' '3179,17$' '1990,83$' '3333,33$' '14653,33$' '4717,50$'
 '4057,50$' '3874,17$' '8746,67$' '2840,00$' '3548,33$' '4570,83$'
 '2318,33$' '5240,00$' '3495,00$' '2110,00$' '11438,33$' '3422,50$'
 '2997,50$' '3429,17$' '5226,67$' '7670,00$' '3644,17$' '1720,00$'
 '2025,00$' '4064,17$' '3133,33$' '1677,50$' '2305,00$' '5427,50$'
 '1855,00$' '4634,17$' '1786,67$' '4477,50$' '2414,17$' '4434,17$'
 '1667,50$' '3670,00$' '3286,67$' '15789,17$' '1678,33$' '11386,67$'
 '4184,17$' '3949,17$' '3597,50$' '1686,67$' '3274,17$' '3687,50$'
 '1940,00$' '2214,17$' '2185,00$' '2676,67$' '2425,83$' '1813,33$'
 '15554,17$' '5341,67$' '4117,50$' '3319,17$' '2420,00$' '2246,67$'
 '5629,17$' '9137,50$' '16171,67$' '5448,33$' '1881,67$' '2211,67$'
 '9945,83$' '3245,00$' '2000,00$' '2872,50$' '16260,83$' '2215,83$'
 '7372,50$' '4042,50$' '3814,17$' '11475,00$' '1914,17$' '2041,67$'
 '3618,33$' '2143,33$' '5416,67$' '2624,17$' '4436,67$' '3651,67$'
 '2127,50$' '4944,17$' '9111,67$' '1685,00$' '3546,67$' '2983,33$'
 '2415,83$' '4635,00$' '1980,83$' '2332,50$' '2876,67$' '2342,50$'
 '3647,50$' '3533,33$' '3522,50$' '3264,17$' '1701,67$' '2350,83$'
 '8297,50$' '1839,17$' '4775,83$' '3781,67$' '1733,33$' '3253,33$'
 '3855,83$' '1918,33$' '8830,00$' '4555,83$' '4807,50$' '1995,00$'
 '2690,83$' '13685,00$' '4705,83$' '1721,67$' '4571,67$' '2635,00$'
 '5542,50$' '2424,17$' '4081,67$' '2650,00$' '3390,83$' '5326,67$'
 '4045,83$' '2760,00$' '2150,00$' '1805,00$' '3645,00$' '4587,50$'
 '2155,83$' '13310,00$' '2860,83$' '2897,50$' '3255,83$' '2870,83$'
 '2300,00$' '5245,00$' '10930,00$' '2992,50$' '4504,17$' '1754,17$'
 '3251,67$' '2218,33$' '4589,17$' '6752,50$' '3315,00$' '4499,17$'
 '8706,67$' '3700,00$' '2216,67$' '2812,50$' '1890,83$' '2340,83$'
 '9045,00$' '2142,50$' '2849,17$' '2084,17$' '2138,33$' '3266,67$'
 '11636,67$' '5450,00$' '1870,00$' '13486,67$' '3527,50$' '12345,00$'
 '1931,67$' '16030,83$' '2126,67$' '2231,67$' '4898,33$' '3439,17$'
 '1790,00$' '5555,83$' '8103,33$' '2823,33$' '2531,67$' '1935,00$'
 '2438,33$' '3754,17$' '5560,83$' '11325,83$' '16264,17$' '16001,67$'
 '8373,33$' '2269,17$' '2634,17$' '1183,33$' '1000,00$' '4365,00$'
 '1975,00$' '5650,83$' '5544,17$' '2063,33$' '1904,17$' '2873,33$'
 '3798,33$' '1418,33$' '2136,67$' '3150,00$' '1950,00$' '1772,50$'
 '1694,17$' '8001,67$' '13855,83$' '1735,83$' '84083$' '6550,83$'
 '2201,67$' '4267,50$' '2245,00$' '4245,00$' '1928,33$' '1673,33$'
 '8793,33$' '1882,50$' '3469,17$' '15252,50$' '1983,33$' '3980,83$'
 '87667$' '6125,83$' '3971,67$' '2377,50$' '1755,83$' '1841,67$'
 '10992,50$' '15220,83$' '93167$' '2365,00$' '15050,83$' '1342,50$'
 '3973,33$' '2003,33$' '5323,33$' '4034,17$' '1728,33$' '2476,67$'
 '5679,17$' '2241,67$' '3489,17$' '9069,17$' '2385,00$' '5612,50$'
 '4411,67$' '2030,83$' '2463,33$' '3873,33$' '2336,67$' '2032,50$'
 '2380,00$' '2444,17$' '2385,83$' '2381,67$' '94083$' '16192,50$'
 '1923,33$' '2115,83$' '1980,00$' '4295,00$' '1811,67$' '2119,17$'
 '1848,33$' '2045,83$' '4380,83$' '2528,33$' '6993,33$' '15990,83$'
 '3578,33$' '3705,83$']

Valores únicos en 'salary':
['195370,00$' '199990,00$' '192320,00$' '171690,00$' nan '100071,84$'
 '53914,11$' '165950,00$' '199730,00$' '134020,00$' '132060,00$'
 '195450,00$' '180410,00$' '192460,00$' '107480,00$' '167520,00$'
 '62010,00$' '198450,00$' '40010,00$' '104470,00$' '191324,62$'
 '160640,00$' '32100,00$' '102660,00$' '104750,00$' '61620,00$'
 '47210,00$' '153407,07$' '28111,13$' '46150,00$' '169590,00$' '54060,00$'
 '59020,00$' '108550,00$' '59140,00$' '66460,00$' '139730,00$' '66870,00$'
 '47350,00$' '138720,00$' '190450,00$' '96130,00$' '115100,00$'
 '170460,00$' '36920,00$' '198470,00$' '23080,00$' '57470,00$'
 '104220,00$' '63470,00$' '23480,00$' '30720,00$' '124900,00$' '80200,00$'
 '170680,00$' '89430,00$' '192720,00$' '55770,00$' '26910,00$' '74030,00$'
 '88230,00$' '35790,00$' '177790,00$' '182130,00$' '135770,00$'
 '191900,00$' '171230,00$' '191870,00$' '79880,00$' '70830,00$'
 '34070,00$' '29290,00$' '120310,00$' '154270,00$' '51260,00$' '96190,00$'
 '190330,00$' '104000,00$' '56740,00$' '191970,00$' '84120,00$'
 '33480,00$' '53090,00$' '76540,00$' '128080,00$' '65860,00$' '25190,00$'
 '170990,00$' '131200,00$' '44440,00$' '98520,00$' '178610,00$'
 '137570,00$' '165980,00$' '42850,00$' '101240,00$' '97140,00$'
 '99240,00$' '112450,00$' '92410,00$' '64720,00$' '30550,00$' '83210,00$'
 '31430,00$' '85780,00$' '98880,00$' '133410,00$' '29090,00$' '95260,00$'
 '44240,00$' '60740,00$' '61460,00$' '61720,00$' '46680,00$' '56050,00$'
 '43190,00$' '35640,00$' '62610,00$' '68040,00$' '194360,00$' '24550,00$'
 '50550,00$' '52570,00$' '59740,00$' '30340,00$' '83920,00$' '40510,00$'
 '48050,00$' '53370,00$' '94340,00$' '53960,00$' '111590,00$' '87930,00$'
 '191890,00$' '22160,00$' '117130,00$' '53040,00$' '111030,00$'
 '66320,00$' '75870,00$' '43350,00$' '59800,00$' '52280,00$' '27000,00$'
 '23660,00$' '23290,00$' '42940,00$' '67250,00$' '103250,00$' '44470,00$'
 '108450,00$' '54720,00$' '63850,00$' '75250,00$' '87400,00$' '134990,00$'
 '34910,00$' '102520,00$' '197400,00$' '62090,00$' '70940,00$' '45340,00$'
 '85000,00$' '46390,00$' '53630,00$' '40810,00$' '35780,00$' '173280,00$'
 '107930,00$' '108510,00$' '104660,00$' '23620,00$' '64390,00$'
 '57690,00$' '40660,00$' '52060,00$' '25700,00$' '45020,00$' '49680,00$'
 '51470,00$' '27180,00$' '54680,00$' '96670,00$' '51540,00$' '56750,00$'
 '73140,00$' '50980,00$' '135700,00$' '67120,00$' '99910,00$' '102480,00$'
 '25930,00$' '80950,00$' '168560,00$' '45370,00$' '179240,00$' '40140,00$'
 '127420,00$' '33760,00$' '104820,00$' '42490,00$' '195860,00$'
 '82370,00$' '47740,00$' '45680,00$' '59930,00$' '64990,00$' '34520,00$'
 '63970,00$' '27250,00$' '36220,00$' '61800,00$' '62740,00$' '43810,00$'
 '25590,00$' '54880,00$' '25140,00$' '31960,00$' '34200,00$' '53680,00$'
 '129360,00$' '42210,00$' '49630,00$' '76390,00$' '135250,00$' '63800,00$'
 '31020,00$' '45560,00$' '42300,00$' '48590,00$' '63220,00$' '107610,00$'
 '29730,00$' '52040,00$' '173990,00$' '168850,00$' '43230,00$' '51550,00$'
 '29360,00$' '187890,00$' '48830,00$' '20290,00$' '29960,00$' '92780,00$'
 '88530,00$' '48760,00$' '21410,00$' '39360,00$' '68420,00$' '39890,00$'
 '49300,00$' '27050,00$' '44480,00$' '23790,00$' '54870,00$' '28100,00$'
 '89380,00$' '99360,00$' '54540,00$' '54730,00$' '135030,00$' '135490,00$'
 '181720,00$' '27740,00$' '94390,00$' '52650,00$' '38150,00$' '23890,00$'
 '175840,00$' '48690,00$' '46490,00$' '104960,00$' '27680,00$' '34080,00$'
 '37550,00$' '21870,00$' '42580,00$' '53260,00$' '27820,00$' '176390,00$'
 '60620,00$' '62880,00$' '34240,00$' '41940,00$' '25320,00$' '56660,00$'
 '137260,00$' '41070,00$' '35970,00$' '41150,00$' '62720,00$' '25170,00$'
 '39040,00$' '92040,00$' '43730,00$' '20640,00$' '24300,00$' '48770,00$'
 '37600,00$' '29740,00$' '27660,00$' '33770,00$' '42130,00$' '65130,00$'
 '42840,00$' '22260,00$' '55610,00$' '53730,00$' '28970,00$' '54100,00$'
 '48500,00$' '39440,00$' '29600,00$' '189470,00$' '64650,00$' '26830,00$'
 '20140,00$' '34410,00$' '136640,00$' '50210,00$' '188440,00$'
 '106500,00$' '43170,00$' '20240,00$' '30580,00$' '39290,00$' '44250,00$'
 '23280,00$' '59400,00$' '26220,00$' '32120,00$' '29110,00$' '69310,00$'
 '21760,00$' '32300,00$' '186650,00$' '27890,00$' '64100,00$' '49410,00$'
 '39830,00$' '29040,00$' '21740,00$' '26570,00$' '109650,00$' '25430,00$'
 '194060,00$' '65380,00$' '22180,00$' '26540,00$' '119350,00$' '25460,00$'
 '38940,00$' '42620,00$' '105270,00$' '36810,00$' '34470,00$' '88470,00$'
 '20450,00$' '48510,00$' '81200,00$' '45770,00$' '54050,00$' '37080,00$'
 '137700,00$' '24500,00$' '43420,00$' '31490,00$' '53240,00$' '43820,00$'
 '25530,00$' '59330,00$' '44030,00$' '109340,00$' '20220,00$' '42560,00$'
 '28990,00$' '23770,00$' '24040,00$' '27990,00$' '28110,00$' '43770,00$'
 '42270,00$' '39170,00$' '49690,00$' '20420,00$' '22070,00$' '20700,00$'
 '27910,00$' '82240,00$' '26100,00$' '57310,00$' '25390,00$' '23760,00$'
 '190810,00$' '27430,00$' '45380,00$' '38670,00$' '20800,00$' '20960,00$'
 '46270,00$' '23020,00$' '50710,00$' '54670,00$' '23940,00$' '36290,00$'
 '93620,00$' '32290,00$' '164220,00$' '44000,00$' '20660,00$' '66510,00$'
 '48980,00$' '31800,00$' '112440,00$' '63920,00$' '33120,00$' '31170,00$'
 '152020,00$' '25800,00$' '21660,00$' '43740,00$' '55050,00$' '159720,00$'
 '23050,00$' '34770,00$' '39070,00$' '34450,00$' '27600,00$' '62940,00$'
 '21050,00$' '39020,00$' '20620,00$' '25870,00$' '55070,00$' '81030,00$'
 '39780,00$' '53990,00$' '44400,00$' '26600,00$' '33750,00$' '22690,00$'
 '47870,00$' '28090,00$' '25710,00$' '61420,00$' '24960,00$' '34190,00$'
 '25010,00$' '39200,00$' '65400,00$' '161840,00$' '171590,00$' '36170,00$'
 '26840,00$' '192370,00$' '44220,00$' '26780,00$' '51710,00$' '119160,00$'
 '93800,00$' '24680,00$' '41270,00$' '21480,00$' '38860,00$' '20900,00$'
 '20860,00$' '19510,00$' '30220,00$' '97240,00$' '33880,00$' '23220,00$'
 '45050,00$' '28350,00$' '65530,00$' '66730,00$' '135910,00$' '21770,00$'
 '195170,00$' '192020,00$' '100480,00$' '27230,00$' '66440,00$'
 '31610,00$' '12000,00$' '52380,00$' '99850,00$' '159920,00$' '23700,00$'
 '67810,00$' '28510,00$' '52580,00$' '22850,00$' '41970,00$' '45580,00$'
 '17020,00$' '25640,00$' '50700,00$' '37800,00$' '98240,00$' '18780,00$'
 '21270,00$' '20330,00$' '96020,00$' '166270,00$' '20830,00$' '10090,00$'
 '78610,00$' '26420,00$' '51210,00$' '26940,00$' '50940,00$' '22740,00$'
 '23140,00$' '23800,00$' '20080,00$' '105520,00$' '22590,00$' '24130,00$'
 '21210,00$' '24790,00$' '131940,00$' '26000,00$' '183030,00$' '47770,00$'
 '10520,00$' '24610,00$' '25960,00$' '47280,00$' '73510,00$' '47660,00$'
 '22580,00$' '28270,00$' '28530,00$' '22900,00$' '21070,00$' '22100,00$'
 '131910,00$' '182650,00$' '23720,00$' '28380,00$' '180610,00$'
 '16110,00$' '47680,00$' '12740,00$' '25610,00$' '15630,00$' '83760,00$'
 '48410,00$' '29720,00$' '68150,00$' '175670,00$' '15690,00$' '41870,00$'
 '33060,00$' '13930,00$' '108830,00$' '67350,00$' '97560,00$' '52940,00$'
 '24370,00$' '40710,00$' '29560,00$' '46480,00$' '28040,00$' '24390,00$'
 '29330,00$' '10910,00$' '51510,00$' '28630,00$' '11290,00$' '194310,00$'
 '21440,00$' '160150,00$' '43060,00$' '28210,00$' '35390,00$' '58130,00$'
 '26960,00$' '67550,00$' '58280,00$' '132120,00$' '27410,00$' '49600,00$'
 '42440,00$']

Valores únicos en 'remotework':
['Yes' '1' 'False' '0' 'True']

### CREACIÓN DE FUNCIÓN PARA QUE ELIMINE LOS ESPACIOS DE TODAS LAS COLUMNAS, TRANSFORME LAS (,) EN (.), LETRAS EN MINÚSCULAS Y ELIMINE SÍMBOLO $

In [98]:
def limpieza(columna):
    
    try: 
        columna = columna.str.strip()
        columna = columna.str.lower()
        columna= columna.str.replace(',','.', regex = False)
        columna = columna.str.replace('$','', regex = False)
    
        return columna
    
    except:
        print(f'Error en la columna{columna}')
        return columna

In [99]:
df[columnas] = df[columnas].apply(limpieza)

In [100]:
for col in columnas:
    print(f"Valores únicos en '{col}':")
    print(df[col].unique(), "\n")

Valores únicos en 'overtime':
['no' nan 'yes']

Valores únicos en 'performancerating':
['3.0' '4.0' nan]

Valores únicos en 'standardhours':
['full time' nan 'part time']

Valores únicos en 'totalworkingyears':
[nan '34.0' '22.0' '28.0' '20.0' '21.0' '33.0' '40.0' '18.0' '25.0' '15.0'
 '17.0' '26.0' '16.0' '24.0' '14.0' '23.0' '27.0' '19.0' '11.0' '38.0'
 '37.0' '13.0' '12.0' '29.0' '10.0' '36.0' '35.0' '9.0' '31.0' '32.0'
 '8.0' '7.0' '30.0' '6.0' '5.0' '4.0' '3.0' '2.0' '1.0' '0.0']

Valores únicos en 'worklifebalance':
['3.0' nan '2.0' '4.0' '1.0']

Valores únicos en 'sameasmonthlyincome':
['16280.83' nan '14307.50' '12783.92' '14311.67' '8339.32' '13829.17'
 '15943.72' '16644.17' '15034.17' '16038.33' '4492.84' '8956.67' '5167.50'
 '3334.17' '8705.83' '2675.00' '8555.00' '8729.17' '3934.17' '3845.83'
 '14132.50' '8588.33' '4505.00' '4918.33' '4928.33' '5538.33' '11100.00'
 '5572.50' '11560.00' '15870.83' '13345.83' '8010.83' '3588.33' '14205.00'
 '4222.50' '3076.67' '2342.59' '4789.17' '8685.00' '5289.17' '1956.67'
 '10408.33' '6683.33' '7452.50' '16060.00' '4647.50' '2242.50' '6169.17'
 '7352.50' '2982.50' '14815.83' '15177.50' '15991.67' '15989.17' '8340.00'
 '6656.67' '5902.50' '3935.83' '2839.17' '2440.83' '10025.83' '12855.83'
 '5135.00' '4271.67' '8015.83' '4175.00' '15860.83' '8666.67' '2327.50'
 '4728.33' '7010.00' '2790.00' '4424.17' '6378.33' '10673.33' '5488.33'
 '2099.17' '10933.33' '2609.17' '5561.67' '14884.17' '6205.00' '11464.17'
 '13831.67' '2557.50' '7700.83' '5393.33' '6934.17' '7148.33' '3497.50'
 '8240.00' '4730.83' '7938.33' '5687.50' '3686.67' '4534.17' '5061.67'
 '5143.33' '4670.83' '3599.17' '2970.00' '5217.50' '5670.00' '16196.67'
 '4856.67' '3901.67' '1765.83' '4978.33' '11010.00' '3375.83' '4004.17'
 '2284.17' '7861.67' '4496.67' '9299.17' '4133.33' '7327.50' '1846.67'
 '9760.83' '4420.00' '9252.50' '5526.67' '6322.50' '3612.50' '4983.33'
 '3536.67' '4356.67' '2250.00' '1971.67' '1940.83' '8604.17' '9037.50'
 '5320.83' '3050.00' '7283.33' '11249.17' '2909.17' '4350.00' '8543.33'
 '16450.00' '5174.17' '3778.33' '7083.33' '3865.83' '4469.17' '3400.83'
 '8994.17' '9042.50' '3654.17' '3388.33' '4338.33' '2212.50' '2141.67'
 '3751.67' '4140.00' '4289.17' '2265.00' '2949.17' '4556.67' '4844.17'
 '8055.83' '4729.17' '6095.00' '11308.33' '8325.83' '8540.00' '9115.00'
 '2160.83' '9898.33' '6745.83' '14046.67' '3780.83' '3345.00' '10618.33'
 '8735.00' '3540.83' '5457.50' '12009.17' '6864.17' '2675.83' '13920.00'
 '3806.67' '4994.17' '5415.83' '5330.83' '3018.33' '5228.33' '4573.33'
 '2095.00' '2663.33' '2850.00' '3405.83' '3500.00' '4171.67' '5418.33'
 '5290.83' '3796.67' '3525.00' '8967.50' '4336.67' '14499.17' '4295.83'
 '15657.50' '4069.17' '2496.67' '7731.67' '3468.33' '7377.50' '6463.33'
 '3324.17' '3085.00' '2254.17' '3706.67' '7448.33' '8280.00' '15616.67'
 '4560.83' '11252.50' '11290.83' '2311.67' '7865.83' '4387.50' '3179.17'
 '1990.83' '3333.33' '14653.33' '4717.50' '4057.50' '3874.17' '8746.67'
 '2840.00' '3548.33' '4570.83' '2318.33' '5240.00' '3495.00' '2110.00'
 '11438.33' '3422.50' '2997.50' '3429.17' '5226.67' '7670.00' '3644.17'
 '1720.00' '2025.00' '4064.17' '3133.33' '1677.50' '2305.00' '5427.50'
 '1855.00' '4634.17' '1786.67' '4477.50' '2414.17' '4434.17' '1667.50'
 '3670.00' '3286.67' '15789.17' '1678.33' '11386.67' '4184.17' '3949.17'
 '3597.50' '1686.67' '3274.17' '3687.50' '1940.00' '2214.17' '2185.00'
 '2676.67' '2425.83' '1813.33' '15554.17' '5341.67' '4117.50' '3319.17'
 '2420.00' '2246.67' '5629.17' '9137.50' '16171.67' '5448.33' '1881.67'
 '2211.67' '9945.83' '3245.00' '2000.00' '2872.50' '16260.83' '2215.83'
 '7372.50' '4042.50' '3814.17' '11475.00' '1914.17' '2041.67' '3618.33'
 '2143.33' '5416.67' '2624.17' '4436.67' '3651.67' '2127.50' '4944.17'
 '9111.67' '1685.00' '3546.67' '2983.33' '2415.83' '4635.00' '1980.83'
 '2332.50' '2876.67' '2342.50' '3647.50' '3533.33' '3522.50' '3264.17'
 '1701.67' '2350.83' '8297.50' '1839.17' '4775.83' '3781.67' '1733.33'
 '3253.33' '3855.83' '1918.33' '8830.00' '4555.83' '4807.50' '1995.00'
 '2690.83' '13685.00' '4705.83' '1721.67' '4571.67' '2635.00' '5542.50'
 '2424.17' '4081.67' '2650.00' '3390.83' '5326.67' '4045.83' '2760.00'
 '2150.00' '1805.00' '3645.00' '4587.50' '2155.83' '13310.00' '2860.83'
 '2897.50' '3255.83' '2870.83' '2300.00' '5245.00' '10930.00' '2992.50'
 '4504.17' '1754.17' '3251.67' '2218.33' '4589.17' '6752.50' '3315.00'
 '4499.17' '8706.67' '3700.00' '2216.67' '2812.50' '1890.83' '2340.83'
 '9045.00' '2142.50' '2849.17' '2084.17' '2138.33' '3266.67' '11636.67'
 '5450.00' '1870.00' '13486.67' '3527.50' '12345.00' '1931.67' '16030.83'
 '2126.67' '2231.67' '4898.33' '3439.17' '1790.00' '5555.83' '8103.33'
 '2823.33' '2531.67' '1935.00' '2438.33' '3754.17' '5560.83' '11325.83'
 '16264.17' '16001.67' '8373.33' '2269.17' '2634.17' '1183.33' '1000.00'
 '4365.00' '1975.00' '5650.83' '5544.17' '2063.33' '1904.17' '2873.33'
 '3798.33' '1418.33' '2136.67' '3150.00' '1950.00' '1772.50' '1694.17'
 '8001.67' '13855.83' '1735.83' '84083' '6550.83' '2201.67' '4267.50'
 '2245.00' '4245.00' '1928.33' '1673.33' '8793.33' '1882.50' '3469.17'
 '15252.50' '1983.33' '3980.83' '87667' '6125.83' '3971.67' '2377.50'
 '1755.83' '1841.67' '10992.50' '15220.83' '93167' '2365.00' '15050.83'
 '1342.50' '3973.33' '2003.33' '5323.33' '4034.17' '1728.33' '2476.67'
 '5679.17' '2241.67' '3489.17' '9069.17' '2385.00' '5612.50' '4411.67'
 '2030.83' '2463.33' '3873.33' '2336.67' '2032.50' '2380.00' '2444.17'
 '2385.83' '2381.67' '94083' '16192.50' '1923.33' '2115.83' '1980.00'
 '4295.00' '1811.67' '2119.17' '1848.33' '2045.83' '4380.83' '2528.33'
 '6993.33' '15990.83' '3578.33' '3705.83']

Valores únicos en 'salary':
['195370.00' '199990.00' '192320.00' '171690.00' nan '100071.84'
 '53914.11' '165950.00' '199730.00' '134020.00' '132060.00' '195450.00'
 '180410.00' '192460.00' '107480.00' '167520.00' '62010.00' '198450.00'
 '40010.00' '104470.00' '191324.62' '160640.00' '32100.00' '102660.00'
 '104750.00' '61620.00' '47210.00' '153407.07' '28111.13' '46150.00'
 '169590.00' '54060.00' '59020.00' '108550.00' '59140.00' '66460.00'
 '139730.00' '66870.00' '47350.00' '138720.00' '190450.00' '96130.00'
 '115100.00' '170460.00' '36920.00' '198470.00' '23080.00' '57470.00'
 '104220.00' '63470.00' '23480.00' '30720.00' '124900.00' '80200.00'
 '170680.00' '89430.00' '192720.00' '55770.00' '26910.00' '74030.00'
 '88230.00' '35790.00' '177790.00' '182130.00' '135770.00' '191900.00'
 '171230.00' '191870.00' '79880.00' '70830.00' '34070.00' '29290.00'
 '120310.00' '154270.00' '51260.00' '96190.00' '190330.00' '104000.00'
 '56740.00' '191970.00' '84120.00' '33480.00' '53090.00' '76540.00'
 '128080.00' '65860.00' '25190.00' '170990.00' '131200.00' '44440.00'
 '98520.00' '178610.00' '137570.00' '165980.00' '42850.00' '101240.00'
 '97140.00' '99240.00' '112450.00' '92410.00' '64720.00' '30550.00'
 '83210.00' '31430.00' '85780.00' '98880.00' '133410.00' '29090.00'
 '95260.00' '44240.00' '60740.00' '61460.00' '61720.00' '46680.00'
 '56050.00' '43190.00' '35640.00' '62610.00' '68040.00' '194360.00'
 '24550.00' '50550.00' '52570.00' '59740.00' '30340.00' '83920.00'
 '40510.00' '48050.00' '53370.00' '94340.00' '53960.00' '111590.00'
 '87930.00' '191890.00' '22160.00' '117130.00' '53040.00' '111030.00'
 '66320.00' '75870.00' '43350.00' '59800.00' '52280.00' '27000.00'
 '23660.00' '23290.00' '42940.00' '67250.00' '103250.00' '44470.00'
 '108450.00' '54720.00' '63850.00' '75250.00' '87400.00' '134990.00'
 '34910.00' '102520.00' '197400.00' '62090.00' '70940.00' '45340.00'
 '85000.00' '46390.00' '53630.00' '40810.00' '35780.00' '173280.00'
 '107930.00' '108510.00' '104660.00' '23620.00' '64390.00' '57690.00'
 '40660.00' '52060.00' '25700.00' '45020.00' '49680.00' '51470.00'
 '27180.00' '54680.00' '96670.00' '51540.00' '56750.00' '73140.00'
 '50980.00' '135700.00' '67120.00' '99910.00' '102480.00' '25930.00'
 '80950.00' '168560.00' '45370.00' '179240.00' '40140.00' '127420.00'
 '33760.00' '104820.00' '42490.00' '195860.00' '82370.00' '47740.00'
 '45680.00' '59930.00' '64990.00' '34520.00' '63970.00' '27250.00'
 '36220.00' '61800.00' '62740.00' '43810.00' '25590.00' '54880.00'
 '25140.00' '31960.00' '34200.00' '53680.00' '129360.00' '42210.00'
 '49630.00' '76390.00' '135250.00' '63800.00' '31020.00' '45560.00'
 '42300.00' '48590.00' '63220.00' '107610.00' '29730.00' '52040.00'
 '173990.00' '168850.00' '43230.00' '51550.00' '29360.00' '187890.00'
 '48830.00' '20290.00' '29960.00' '92780.00' '88530.00' '48760.00'
 '21410.00' '39360.00' '68420.00' '39890.00' '49300.00' '27050.00'
 '44480.00' '23790.00' '54870.00' '28100.00' '89380.00' '99360.00'
 '54540.00' '54730.00' '135030.00' '135490.00' '181720.00' '27740.00'
 '94390.00' '52650.00' '38150.00' '23890.00' '175840.00' '48690.00'
 '46490.00' '104960.00' '27680.00' '34080.00' '37550.00' '21870.00'
 '42580.00' '53260.00' '27820.00' '176390.00' '60620.00' '62880.00'
 '34240.00' '41940.00' '25320.00' '56660.00' '137260.00' '41070.00'
 '35970.00' '41150.00' '62720.00' '25170.00' '39040.00' '92040.00'
 '43730.00' '20640.00' '24300.00' '48770.00' '37600.00' '29740.00'
 '27660.00' '33770.00' '42130.00' '65130.00' '42840.00' '22260.00'
 '55610.00' '53730.00' '28970.00' '54100.00' '48500.00' '39440.00'
 '29600.00' '189470.00' '64650.00' '26830.00' '20140.00' '34410.00'
 '136640.00' '50210.00' '188440.00' '106500.00' '43170.00' '20240.00'
 '30580.00' '39290.00' '44250.00' '23280.00' '59400.00' '26220.00'
 '32120.00' '29110.00' '69310.00' '21760.00' '32300.00' '186650.00'
 '27890.00' '64100.00' '49410.00' '39830.00' '29040.00' '21740.00'
 '26570.00' '109650.00' '25430.00' '194060.00' '65380.00' '22180.00'
 '26540.00' '119350.00' '25460.00' '38940.00' '42620.00' '105270.00'
 '36810.00' '34470.00' '88470.00' '20450.00' '48510.00' '81200.00'
 '45770.00' '54050.00' '37080.00' '137700.00' '24500.00' '43420.00'
 '31490.00' '53240.00' '43820.00' '25530.00' '59330.00' '44030.00'
 '109340.00' '20220.00' '42560.00' '28990.00' '23770.00' '24040.00'
 '27990.00' '28110.00' '43770.00' '42270.00' '39170.00' '49690.00'
 '20420.00' '22070.00' '20700.00' '27910.00' '82240.00' '26100.00'
 '57310.00' '25390.00' '23760.00' '190810.00' '27430.00' '45380.00'
 '38670.00' '20800.00' '20960.00' '46270.00' '23020.00' '50710.00'
 '54670.00' '23940.00' '36290.00' '93620.00' '32290.00' '164220.00'
 '44000.00' '20660.00' '66510.00' '48980.00' '31800.00' '112440.00'
 '63920.00' '33120.00' '31170.00' '152020.00' '25800.00' '21660.00'
 '43740.00' '55050.00' '159720.00' '23050.00' '34770.00' '39070.00'
 '34450.00' '27600.00' '62940.00' '21050.00' '39020.00' '20620.00'
 '25870.00' '55070.00' '81030.00' '39780.00' '53990.00' '44400.00'
 '26600.00' '33750.00' '22690.00' '47870.00' '28090.00' '25710.00'
 '61420.00' '24960.00' '34190.00' '25010.00' '39200.00' '65400.00'
 '161840.00' '171590.00' '36170.00' '26840.00' '192370.00' '44220.00'
 '26780.00' '51710.00' '119160.00' '93800.00' '24680.00' '41270.00'
 '21480.00' '38860.00' '20900.00' '20860.00' '19510.00' '30220.00'
 '97240.00' '33880.00' '23220.00' '45050.00' '28350.00' '65530.00'
 '66730.00' '135910.00' '21770.00' '195170.00' '192020.00' '100480.00'
 '27230.00' '66440.00' '31610.00' '12000.00' '52380.00' '99850.00'
 '159920.00' '23700.00' '67810.00' '28510.00' '52580.00' '22850.00'
 '41970.00' '45580.00' '17020.00' '25640.00' '50700.00' '37800.00'
 '98240.00' '18780.00' '21270.00' '20330.00' '96020.00' '166270.00'
 '20830.00' '10090.00' '78610.00' '26420.00' '51210.00' '26940.00'
 '50940.00' '22740.00' '23140.00' '23800.00' '20080.00' '105520.00'
 '22590.00' '24130.00' '21210.00' '24790.00' '131940.00' '26000.00'
 '183030.00' '47770.00' '10520.00' '24610.00' '25960.00' '47280.00'
 '73510.00' '47660.00' '22580.00' '28270.00' '28530.00' '22900.00'
 '21070.00' '22100.00' '131910.00' '182650.00' '23720.00' '28380.00'
 '180610.00' '16110.00' '47680.00' '12740.00' '25610.00' '15630.00'
 '83760.00' '48410.00' '29720.00' '68150.00' '175670.00' '15690.00'
 '41870.00' '33060.00' '13930.00' '108830.00' '67350.00' '97560.00'
 '52940.00' '24370.00' '40710.00' '29560.00' '46480.00' '28040.00'
 '24390.00' '29330.00' '10910.00' '51510.00' '28630.00' '11290.00'
 '194310.00' '21440.00' '160150.00' '43060.00' '28210.00' '35390.00'
 '58130.00' '26960.00' '67550.00' '58280.00' '132120.00' '27410.00'
 '49600.00' '42440.00']

Valores únicos en 'remotework':
['yes' '1' 'false' '0' 'true']

### Amplío las transformaciones a realizar según cada output de la columna específca tras la transformación general

### Valores únicos en 'overtime':
['no' nan 'yes']

In [101]:
df['overtime'].isnull().sum()

696

In [102]:
df['overtime'] = df['overtime'].fillna('none')

In [103]:
df['overtime'].value_counts()

overtime
no      714
none    696
yes     268
Name: count, dtype: int64

### Valores únicos en 'performancerating':
[ 3.  4. nan]

In [22]:
df['performancerating'].isnull().sum()

200

In [105]:
df['performancerating'].info()

<class 'pandas.core.series.Series'>
Index: 1678 entries, 0 to 1677
Series name: performancerating
Non-Null Count  Dtype
--------------  -----
1478 non-null   object
dtypes: object(1)
memory usage: 26.2+ KB

In [106]:
porcentaje_nulos = (df['performancerating'].isnull().sum()/len(df))*100
print(porcentaje_nulos)

11.918951132300357

Dadao el procentaje obtenido de nulos, sustituimos los valores nulos por el dato de la media de la columna

In [107]:
df['performancerating'] = pd.to_numeric(df['performancerating'], errors='coerce')

# Ahora calculamos la media de la columna, ignorando los valores nulos
media_value = int(df['performancerating'].mean())

# Rellenamos los valores nulos con la media
df['performancerating'] = df['performancerating'].fillna(media_value)

In [108]:
df['performancerating'] = df['performancerating'].astype(int)

In [115]:
df['performancerating'].sample(15)

717     3
452     3
285     3
1390    3
763     3
163     4
1494    3
38      3
1530    3
116     3
1073    3
1291    3
250     3
18      3
539     4
Name: performancerating, dtype: int64

### Valores únicos en 'standardhours':
['full time' None 'part time']

In [116]:
df['standardhours']= df['standardhours'].str.replace(' ','_')

In [117]:
df['standardhours']= df['standardhours'].fillna('none')

In [119]:
df['standardhours'].sample(15)

1542    part_time
304     part_time
1413    full_time
1601    part_time
1359         none
610     part_time
1007    part_time
1275    full_time
852     part_time
492     part_time
889     part_time
434     full_time
690     part_time
1185         none
344     full_time
Name: standardhours, dtype: object

### Valores únicos en 'totalworkingyears':

In [120]:
df['totalworkingyears'].isnull().sum()

549

In [121]:
df['totalworkingyears'].info()

<class 'pandas.core.series.Series'>
Index: 1678 entries, 0 to 1677
Series name: totalworkingyears
Non-Null Count  Dtype
--------------  -----
1129 non-null   object
dtypes: object(1)
memory usage: 26.2+ KB

In [122]:
porcentaje_nulos2= (df['totalworkingyears'].isnull().sum()/len(df))*100

In [123]:
porcentaje_nulos2

32.717520858164484

ESTE DATO ES IMPORTANTE PARA NUESTRO ANÁLISIS Y POR ELLO OPTAMOS POR APLICAR LA LA MEDIANA TENIENDO EN CUENTA EL 33% DE NULOS QUE TENEMOS.

In [124]:
# Convertir la columna 'totalworkingyears' a valores numéricos, forzando la conversión de errores a NaN
df['totalworkingyears'] = pd.to_numeric(df['totalworkingyears'], errors='coerce')

# Ahora calculamos la media de la columna, ignorando los valores nulos
mean_value = int(df['totalworkingyears'].mean())

# Rellenamos los valores nulos con la media
df['totalworkingyears'] = df['totalworkingyears'].fillna(mean_value)

In [130]:
df['totalworkingyears'].sample(15)

953      4.0
860     11.0
930     10.0
1295    10.0
27      18.0
276     11.0
994     23.0
736      7.0
1085    11.0
204     10.0
637     15.0
102     11.0
425     11.0
997     11.0
1513    11.0
Name: totalworkingyears, dtype: float64

In [131]:
df['totalworkingyears']=df['totalworkingyears'].astype(int)

In [139]:
df['totalworkingyears'].sample(15)

1016     3
221     11
547     11
670     16
562      6
204     10
887      5
1659    11
868     11
1379    23
1053     7
520     24
1567    14
1219     6
420     21
Name: totalworkingyears, dtype: int64

### Valores únicos en 'worklifebalance':
['3,0' nan '2,0' '4,0' '1,0']

In [140]:
df['worklifebalance'].value_counts()

worklifebalance
3.0    946
2.0    374
4.0    162
1.0     82
Name: count, dtype: int64

In [141]:
df['worklifebalance'].isnull().sum()

114

In [142]:
porcentaje = (df['worklifebalance'].isnull().sum()/len(df))*100
porcentaje

6.793802145411204

El porcentaje obtenido es muy pequeño, cambiamos los valores nulos por la media

In [143]:
# Convertir la columna a valores numéricos, forzando la conversión de errores a NaN
df['worklifebalance'] = pd.to_numeric(df['worklifebalance'], errors='coerce')

# Ahora calculamos la media de la columna, ignorando los valores nulos
mean_value = int(df['worklifebalance'].mean())

# Rellenamos los valores nulos con la media
df['worklifebalance'] = df['worklifebalance'].fillna(mean_value)

In [146]:
df['worklifebalance'].sample(15)

210     2.0
615     2.0
2       2.0
52      2.0
922     3.0
878     2.0
1436    3.0
1234    3.0
1241    3.0
556     3.0
1133    3.0
255     2.0
1517    3.0
1097    3.0
747     2.0
Name: worklifebalance, dtype: float64

In [147]:
df['worklifebalance']=df['worklifebalance'].astype(int)

In [148]:
df['worklifebalance'].value_counts()

worklifebalance
3    946
2    488
4    162
1     82
Name: count, dtype: int64

### Valores únicos en 'sameasmonthlyincome':
['16280.83' None '14307.50' '12783.92' '14311.67' '8339.32' '13829.17'
 '15943.72' '16644.17' '15034.17' '16038.33' '4492.84' '8956.67' '5167.50'
 '3334.17' '8705.83' '2675.00' '8555.00'

In [149]:
df['sameasmonthlyincome'].info()

<class 'pandas.core.series.Series'>
Index: 1678 entries, 0 to 1677
Series name: sameasmonthlyincome
Non-Null Count  Dtype
--------------  -----
1189 non-null   object
dtypes: object(1)
memory usage: 26.2+ KB

In [150]:
df['sameasmonthlyincome'].isnull().sum()

489

In [151]:
porcentaje= (df['sameasmonthlyincome'].isnull().sum()/len(df))*100
porcentaje

29.141835518474373

Optamos por utilizar la mediana ya que el porcentaje de nulos es del 30%

In [152]:
df['sameasmonthlyincome'] = pd.to_numeric(df['sameasmonthlyincome'], errors='coerce')

# Ahora calculamos la media de la columna, ignorando los valores nulos
median_value = int(df['sameasmonthlyincome'].median())

# Rellenamos los valores nulos con la media
df['sameasmonthlyincome'] = df['sameasmonthlyincome'].fillna(median_value)

In [154]:
df['sameasmonthlyincome'].sample(15)

956     9111.67
737     3429.17
25      4492.00
375     4492.00
1172    4492.00
1076    4492.84
1237    4492.00
1195    4492.84
612     4492.00
1586    7327.50
1243    2823.33
1518    4492.00
1593    6322.50
844     1940.00
127     4492.84
Name: sameasmonthlyincome, dtype: float64

In [155]:
df['sameasmonthlyincome']=df['sameasmonthlyincome'].astype(float)

In [156]:
df['sameasmonthlyincome'].info()

<class 'pandas.core.series.Series'>
Index: 1678 entries, 0 to 1677
Series name: sameasmonthlyincome
Non-Null Count  Dtype
--------------  -----
1678 non-null   float64
dtypes: float64(1)
memory usage: 26.2 KB

### Valores únicos en 'salary':
['195370.00' '199990.00' '192320.00' '171690.00' None '100071.84'
 '53914.11' '165950.00' '199730.00'

In [157]:
df['salary'].info()

<class 'pandas.core.series.Series'>
Index: 1678 entries, 0 to 1677
Series name: salary
Non-Null Count  Dtype
--------------  -----
1393 non-null   object
dtypes: object(1)
memory usage: 26.2+ KB

In [158]:
df['salary'].isnull().sum()

285

In [159]:
porcentaje = (df['salary'].isnull().sum()/len(df))*100
porcentaje

16.98450536352801

Dado el bajo porcentaje de nulos aplicamos la media para sustituirlos

In [160]:
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')

# Ahora calculamos la media de la columna, ignorando los valores nulos
media_value = int(df['salary'].mean())

# Rellenamos los valores nulos con la media
df['salary'] = df['salary'].fillna(media_value)

In [167]:
df['salary'].sample(15)

256      53914.11
1226     20900.00
1144     39780.00
1503     53914.11
978      28111.13
1405     83760.00
294     191324.62
1525     28111.13
1651     64990.00
155      53914.11
672     153407.07
783      28970.00
562      28111.13
500     179240.00
2       192320.00
Name: salary, dtype: float64

In [168]:
df['salary']=df['salary'].astype(float)

In [169]:
df['salary'].info()

<class 'pandas.core.series.Series'>
Index: 1678 entries, 0 to 1677
Series name: salary
Non-Null Count  Dtype
--------------  -----
1678 non-null   float64
dtypes: float64(1)
memory usage: 26.2 KB

### Valores únicos en 'remotework':
['yes' '1' 'false' '0' 'true']

In [170]:
df['remotework'] = df['remotework'].str.replace('1','yes')
df['remotework'] = df['remotework'].str.replace('true','yes')
df['remotework'] = df['remotework'].str.replace('0','no')
df['remotework'] = df['remotework'].str.replace('false','no')

In [171]:
df['remotework'].value_counts()

remotework
yes    1042
no      636
Name: count, dtype: int64

In [172]:
df['remotework'].isnull().sum()

0

### Columnas finales tras limpieza realizada

In [173]:
df[columnas].sample(15)

,overtime,performancerating,standardhours,totalworkingyears,worklifebalance,sameasmonthlyincome,salary,remotework
348,no,3,full_time,30,2,9252.50,111030.00,no
352,none,3,full_time,17,3,4983.33,59800.00,yes
920,none,3,full_time,11,3,2872.50,34470.00,yes
1646,none,3,part_time,1,3,4492.00,19510.00,yes
670,no,3,full_time,16,1,11290.83,135490.00,no
201,yes,3,full_time,11,3,2790.00,33480.00,no
1331,none,3,part_time,9,3,4492.00,53914.11,yes
1529,no,4,full_time,11,3,4492.00,109650.00,no
1279,no,3,part_time,0,3,1000.00,12000.00,no
1253,none,4,full_time,11,3,4492.00,28350.00,no
354,no,3,none,24,2,15943.72,65070.00,yes
491,none,3,none,12,3,9898.33,65070.00,yes
959,none,3,part_time,10,2,1685.00,20220.00,yes
940,yes,3,none,24,3,15943.72,65070.00,no
409,none,3,full_time,11,4,5174.17,62090.00,no

# CÓDIGO DE ISA

In [64]:
df.dtypes[["businesstravel", "educationfield","maritalstatus" , "overtime", "performancerating" , "hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary", "totalworkingyears"]]

businesstravel          object
educationfield          object
maritalstatus           object
overtime                object
performancerating        int64
hourlyrate             float64
monthlyincome           object
over18                  object
standardhours           object
worklifebalance          int64
sameasmonthlyincome    float64
salary                 float64
totalworkingyears        int64
dtype: object

Cambiar datos NaN a Null: 
Chatgpt
pd.notna(df[col]) es una función de Pandas que nos ayuda a identificar qué valores NO son NaN dentro de una columna. 

¿Qué hace pd.notna(df[col])?

Esta función devuelve un array de valores True o False, donde:
✅ True → Significa que el valor NO es NaN (es decir, hay un dato válido).
❌ False → Significa que el valor ES NaN (es decir, falta información).

In [65]:
#  transformar esta columna en formato INT.

df["performancerating"] = df["performancerating"].astype(str).str.replace(",", ".").astype(float)

# .astype(str) -> Convierte todos los valores en texto.
# .str.replace(",", ".") -> Reemplaza las comas por puntos.
# .astype(float) -> Convierte la columna a número

In [66]:
df["performancerating"].dtype

dtype('float64')

In [67]:
df["performancerating"].head()

0    3.0
1    3.0
2    3.0
3    3.0
4    3.0
Name: performancerating, dtype: float64

In [68]:
# para una sola columna seria:

df["salary"] = df["salary"].where(pd.notna(df["salary"]), None)

# Explicación del código:
#  pd.notna(df["salary"]) detecta los valores no nulos (True) y los valores NaN (False).
#  .where(pd.notna(df["salary"]), None) mantiene los valores True (no NaN) y reemplaza los False (NaN) con None.

In [69]:
df["salary"].isnull().sum()

0

In [70]:
# reviso la columna y ya esta cambiado NaN por None.

df["salary"].sample(10)

1093     21660.00
1394     28111.13
497     168560.00
1270     27230.00
1442     65070.00
847      65070.00
1073     65070.00
1046     93620.00
9        65070.00
420     153407.07
Name: salary, dtype: float64

In [71]:
# Voy a cambiar los datos NaN que dan error en SQL por None en las columnas que faltan.

columnas_a_convertir = ["businesstravel", "educationfield","maritalstatus" , "overtime", "performancerating" , "hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary", "totalworkingyears"]
for col in columnas_a_convertir:
    df[col] = df[col].where(pd.notna(df[col]), None)

# pd.notna(df[col]) -> Detecta los valores que no son NaN.
# .where(...) -> Mantiene los valores correctos y reemplaza los NaN con None.

In [72]:
df[["hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary","totalworkingyears"]].sample(10)

,hourlyrate,monthlyincome,over18,standardhours,worklifebalance,sameasmonthlyincome,salary,totalworkingyears
839,NaN,"2342,59$",Y,part_time,2,2342.59,28111.13,11
1525,NaN,"2342,59$",None,part_time,2,2342.59,28111.13,3
1598,67.424603,"4356,67$",None,part_time,3,4356.67,52280.00,11
760,NaN,"1677,50$",None,none,3,1677.50,65070.00,11
432,NaN,None,None,part_time,3,4492.00,53914.11,9
399,NaN,"4350,00$",None,none,3,4350.00,65070.00,12
939,NaN,"2342,59$",Y,part_time,3,2342.59,28111.13,11
887,NaN,"2342,59$",None,part_time,3,2342.59,28111.13,5
1625,NaN,None,Y,part_time,3,4492.00,24790.00,7
1170,NaN,"2849,17$",None,full_time,4,2849.17,34190.00,11

Siguientes pasos:

- hay simbolo $ en valores de columna de precios o sueldos, mejor quitarlo y poner el $ en el nombre de la columna.
- hay textos escritos con errores tipograficos 
- hay textos escritos diferentes, con mayusculas o minusculas.
- hay espacios delante o detras en algunos OBJECTS.
- cambiar gender de 0-1 a Male o Female.

# Posibilidad de Rellenar valores nulos con datos adecuados

Algunas columnas tienen nulos moderados (10-50%), se puede rellenar con valores adecuados.
-> Posibles opciones de relleno:
"businesstravel" -> Rellenar con "No Travel" (si el nulo significa que no viajan).
"educationfield" -> Rellenar con "Unknown" si no conocemos el campo de estudio.
"maritalstatus" -> Rellenar con "Single" (opción estándar si faltan datos).
"overtime" -> Rellenar con "No" (asumiendo que el nulo significa que no hacen horas extra).
"performancerating" -> Rellenar con la media o mediana o poner none

---------------------------------------------------------------------------------------------------------

LIMPIEZA DATA COLUMNAS:  'age', 'attrition', 'businesstravel', 'department', 'educationfield',
       'jobrole', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18'

In [73]:
# 1. EXPLORAR COLUMNAS:

In [74]:
df.columns.tolist() # saco los nombres de las columnas en una lista.

['age',
 'attrition',
 'businesstravel',
 'dailyrate',
 'distancefromhome',
 'education',
 'educationfield',
 'employeecount',
 'employeenumber',
 'environmentsatisfaction',
 'gender',
 'hourlyrate',
 'jobinvolvement',
 'joblevel',
 'jobrole',
 'jobsatisfaction',
 'maritalstatus',
 'monthlyincome',
 'monthlyrate',
 'numcompaniesworked',
 'over18',
 'overtime',
 'percentsalaryhike',
 'performancerating',
 'relationshipsatisfaction',
 'standardhours',
 'stockoptionlevel',
 'totalworkingyears',
 'trainingtimeslastyear',
 'worklifebalance',
 'yearsatcompany',
 'yearssincelastpromotion',
 'yearswithcurrmanager',
 'sameasmonthlyincome',
 'datebirth',
 'salary',
 'remotework']

In [75]:
df[['age', 'attrition', 'businesstravel', 'educationfield','jobrole', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18']].head(3)

,age,attrition,businesstravel,educationfield,jobrole,maritalstatus,monthlyincome,monthlyrate,over18
0,51,No,None,None,resEArch DIREcToR,None,"16280,83$","42330,17$",Y
1,52,No,None,Life Sciences,ManAGeR,None,None,"43331,17$",None
2,42,No,travel_rarely,Technical Degree,ManaGER,Married,None,"41669,33$",None

In [76]:
df[['age', 'attrition', 'businesstravel', 'educationfield','jobrole', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18']].dtypes

age               object
attrition         object
businesstravel    object
educationfield    object
jobrole           object
maritalstatus     object
monthlyincome     object
monthlyrate       object
over18            object
dtype: object

*** AGE ***

In [77]:
# analizo columna AGE: son edades pero aparece como objetc, hay que pasarlo a INT.

df['age'].sample(15)

# vemos que hay algunos valores escritos en letra.

497     52
651     38
401     36
1299    47
1215    38
172     56
113     34
1151    54
1420    41
48      37
869     31
1460    42
406     43
137     38
1544    29
Name: age, dtype: object

In [78]:
df["age"] = df["age"].str.strip() # primero quito los posibles espacios que puedan haber antes o despues del numero.

- He intentado cambiar el tipo de columna con .astype() pero me ha estado dando error hasta que he visto que hay numeros escritos en letra en ingles.

-> df["age"] = df["age"].astype(int)  # astype() se usa para cambiar el tipo de dato de una columna 

- esto da error puesto que hay numeros escritos en ingles y eso no se puede convertir directamente con .astype()

Podria solucionar esto de dos formas:
- Creando un diccionario a mano con las palabras como clave y el numero como valor y luego definiendo una funcion para cambiarlo:
        * numeros = { "eighteen":18, "nineteen":19, "twenty": 20....}

- usar una libreria externa WORD2NUMBER que hace justo eso: convierte texto en ingles a número. Se instala como todas:
    pip install word2number
    from word2number import w2n

    w2n.word_to_num("forty_seven") -> devuelte 47 en numero 

    la libreria es mas rapido y limpio

In [79]:
# pip install word2number    como ya he hecho el pip install no inhabilito.

In [80]:
from word2number import w2n

ModuleNotFoundError: No module named 'word2number'

In [ ]:
# ya he importado la libreria, hago una funcion para limpiar la columna age:
# necesito pasarlo todo a texto/string primero.

def convertir_edad(valor):  # Definimos la función. Le pasaremos una edad, que puede ser: un numero ("42"), un string o un Nulo (NaN)
    if pd.isnull(valor):    # Si el valor es nulo (NaN), lo dejamos como None. 
        return None
    valor = str(valor).strip().lower() # str(valor) lo convierte a texto/string por si viene como numero, con .strip() elimino posibles espacios y .lower()lo paso todo a minusculas.
    try:
        return int(valor) if valor.isdigit() else w2n.word_to_num(valor)  # si el valor es .isdigit() significa que es un numero tipo "42" y uso INT para convertirlo, si no es numero sino letra (forty-two) uso w2n para traducirlo.
    except:
        return None  # Por si hay algún texto no válido


#con el try me aseguro de cambiar a INT si es un "35" y me de 35 y si esta escrito "twenty" uso w2n para que me de 20 en INT

In [ ]:
df["age"] = df["age"].apply(convertir_edad)

# con apply aplico la funcion que acabo de hacer a cada fila de la columna AGE para que realice los cambios a INT. 
# El resultado se guarda en la misma columna.

In [ ]:
df["age"].head(5)

# ya aparece como INT.

0    51
1    52
2    42
3    47
4    46
Name: age, dtype: int64

RESUMEN DE CAMBIOS DE AGE:
- .strip()
Elimina espacios en blanco al principio y al final de un string.
Ejemplo: ' hola '.strip() → 'hola'
- .isdigit()
Devuelve True si todos los caracteres del string son dígitos (números enteros positivos).
Ejemplo: '42'.isdigit() → True, 'forty-two'.isdigit() → False.  No detecta decimales, negativos ni espacios. 
- .apply()
Aplica una función a cada valor de una columna (o fila si se usa con axis=1).
El resultado se guarda en la columna.

*** attrition ***

In [ ]:
df['attrition'].head()

# pasar a minusculas
# quitar posibles espacios.

0    No
1    No
2    No
3    No
4    No
Name: attrition, dtype: object

In [ ]:
df["attrition"] = df["attrition"].str.strip().str.lower()

# .str.strip().str.lower() limpia espacios y pone todo en minúsculas.

In [ ]:
df['attrition'].sample(3)

967    yes
374     no
876     no
Name: attrition, dtype: object

*** Businesstravel ***

In [ ]:
df["businesstravel"].sample(5)

# quitar espacios
# poner todo en minusculas
# quitar los _ y dejar espacios " "

848              None
1274    travel rarely
1410             None
1096    travel rarely
329     travel rarely
Name: businesstravel, dtype: object

In [ ]:
df["businesstravel"] = (df["businesstravel"].str.strip().str.lower().str.replace("_", " "))

# .str.replace("_", " "): cambia guiones por espacios.
# .str.lower(): pone todo en minusculas.
# .str.strip(): limpia espacios extra.

In [ ]:
df["businesstravel"].sample(5)

# al revisar veo que tambien hay guion medio en algunos valores.

1117             None
622     travel rarely
1423             None
26               None
169              None
Name: businesstravel, dtype: object

In [ ]:
df["businesstravel"] = (df["businesstravel"].str.strip().str.lower().str.replace("_", " ").str.replace("-", " "))

# aqui incluyo el .replace del guion medio que no me habia dado cuenta antes.

In [ ]:
df["businesstravel"].sample(5)

233     travel rarely
1065    travel rarely
41      travel rarely
576              None
1323    travel rarely
Name: businesstravel, dtype: object

*** Educationfield ***

In [ ]:
df['educationfield'].sample(5)

# quitar espacios
# poner en minusculas.
# NaN -> None ya lo hice

310          None
1478         None
1165    Marketing
377     Marketing
423          None
Name: educationfield, dtype: object

In [ ]:
df["educationfield"] = df["educationfield"].str.strip().str.lower()

In [ ]:
df['educationfield'].sample(5)

464     life sciences
1533             None
1006             None
379              None
643              None
Name: educationfield, dtype: object

*** jobrole ***

In [ ]:
df['jobrole'].sample(3)

# espacios al principio y al final
# poner en minusculas

845      hEaltHcare rEpREseNTatiVE
1453            rEsEArCh sCIENtIsT
587             REsearCH SCiEntist
Name: jobrole, dtype: object

In [ ]:
df["jobrole"] = df["jobrole"].str.strip().str.lower()

In [ ]:
df['jobrole'].sample(3)

1207                  manager
1361    laboratory technician
1496                  manager
Name: jobrole, dtype: object

*** Maritalstatus ***

In [ ]:
df['maritalstatus'].sample(20)

# quitar posibles espacios.
# poner en minusculas.
# hay error ortografico  en married alguno pone "marreid"

356      Married
1635     Married
717       Single
919         None
849      Married
1107        None
745      Married
939       Single
632      Married
892         None
1623     Marreid
1016    Divorced
1428      Single
72          None
145      Married
1393      Single
893      Married
1055        None
1399        None
526       Single
Name: maritalstatus, dtype: object

In [ ]:
df["maritalstatus"] = df["maritalstatus"].str.strip().str.lower()

In [ ]:
df["maritalstatus"] = df["maritalstatus"].replace("marreid", "married")

# .replace del error ortografico.

In [ ]:
df["maritalstatus"].sample(5)

637       single
1058      single
815     divorced
25       married
1302        None
Name: maritalstatus, dtype: object

*** Monthlyincome ***

In [ ]:
df['monthlyincome'].sample(5)

# pasar a float (reemplazar , por . para float)
# quitar espacios
# quitar simbolo $

1566        None
11          None
966         None
83      8339,32$
1526    2214,17$
Name: monthlyincome, dtype: object

In [ ]:
df["monthlyincome"] = (df["monthlyincome"].str.strip().str.replace("$", "").str.replace(",", ".").astype(float))

# .str.strip() -> quitar espacios
# .str.replace() -> quitar el símbolo $
# .str.replace() -> cambiar coma por punto
# .astype(float) -> convertir a número decimal

In [ ]:
df['monthlyincome'].sample(5)

# veo que aqui aparecen nulos como NaN que no se cambiaron al inicio, los cambio ahora.

537     3018.33
238         NaN
1323    4267.50
311     4492.84
1198    1980.83
Name: monthlyincome, dtype: float64

In [ ]:
df["monthlyincome"] = df["monthlyincome"].where(pd.notnull(df["monthlyincome"]), None) # Deja los valores que no son nulos como están, y cambia los NaN por None.

In [ ]:
df['monthlyincome'].sample(5)

845    4492.84
975        NaN
901        NaN
835    2342.59
181    4492.84
Name: monthlyincome, dtype: float64

*** IMPORTANTE ***

Siguen apareciendo valores Nan porque Pandas sigue mostrando NaN incluso si internamente hay None, cuando la columna tiene tipo numérico (float64 en este caso) Y Pandas no puede mezclar números con None en columnas de tipo float64, así que internamente lo convierte a NaN aunque tú hayas puesto None.
Como vamos a trabajar despues con SQL y tenemos que quitar esos valores Nan para que no nos den error tendremos que tener esta columna como OBJETC y no como FLOAT para poder tener valores nulos -> None.

In [ ]:
# como ya le he quitado los espacios, la coma, y el $, pero está en FLOAT, ahora lo paso a OBJECT para poder tener NONE

In [ ]:
df["monthlyincome"] = df["monthlyincome"].astype("object")
df["monthlyincome"] = df["monthlyincome"].where(pd.notnull(df["monthlyincome"]), None) # Deja los valores que no son nulos como están, y cambia los NaN por None.

# ahora esta como OBJETC y NONE

In [ ]:
df['monthlyincome'].sample(5)

1485     2350.83
327         None
1620     2342.59
806     15789.17
1605        None
Name: monthlyincome, dtype: object

*** Monthlyrate ***

In [ ]:
df["monthlyrate"].sample(5)

# lo mismo que en el anterior pero primero voy a comprobar si hay algun NaN

1166     6090,75$
1644     6090,75$
258     28905,50$
644     16804,67$
627     11681,39$
Name: monthlyrate, dtype: object

In [ ]:
df["monthlyrate"].isna().sum()

# como esta columna no tiene NaN si que voy a pasarlo a Float.

np.int64(0)

In [ ]:
df["monthlyrate"] = (df["monthlyrate"].str.strip().str.replace("$", "").str.replace(",", ".").astype(float))

In [ ]:
df["monthlyrate"].sample(5)

238     21502.00
593     11681.39
95      11681.39
146     29416.83
1046    20284.33
Name: monthlyrate, dtype: float64

*** Over18 ***

In [ ]:
df["over18"].sample(5)

# todos los valores son "Y" o None, no aporta informacion util, eliminarla.
# voy a poner en minuscula y quitar espacios de todas formas.

1614       Y
293     None
1300       Y
1505    None
787     None
Name: over18, dtype: object

In [ ]:
df["over18"] = df["over18"].str.strip().str.lower()

In [ ]:
df["over18"].sample(5)

755        y
881     None
1030       y
852        y
640        y
Name: over18, dtype: object